perf_test/results/read_20260531_135104/report.txt
Requests      [total, rate, throughput]         300, 5.02, 0.00
Duration      [total, attack, wait]             3m0s, 59.8s, 2m0s
Latencies     [min, mean, 50, 90, 95, 99, max]  2m0s, 2m2s, 2m0s, 2m9s, 2m11s, 2m14s, 2m14s
Bytes In      [total, mean]                     0, 0.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           0.00%
Status Codes  [code:count]                      0:300  
Error Set:
Get "http://localhost:8089/api/v1/chats/": context deadline exceeded (Client.Timeout exceeded while awaiting headers)